Repository: airy-pay/airy-pay
Catalog: src/AiryPayNew.Discord/Localization/Localization.*.resx
Languages: de, pt, ru

# _languageName
source: English
de: Deutsch
pt: Português
ru: Русский

source: Shop not found
de: Shop nicht gefunden
pt: Loja não encontrada
ru: Магазин не найден

source: Shop Information
de: Shop-Informationen
pt: Informações da Loja
ru: Информация о магазине

source: Balance
de: Kontostand
pt: Saldo
ru: Баланс

source: Status
ru: Статус

source: Products
de: Produkte
pt: Produtos
ru: Товары

source: Shop ID
pt: ID da Loja
ru: ID Магазина

source: Blocked
de: Gesperrt
pt: Bloqueado
ru: Заблокирован

source: Active
de: Aktiv
pt: Ativo
ru: Активен

# noProducts
source: Nothing here yet Create a new product using the /product create command.
de: Derzeit leer. Erstelle ein neues Produkt mit `/product create`
pt: Está vazio por enquanto. Crie um novo produto com `/product create`
ru: Тут пока пусто. Создайте новый товар при помощи команды `/product create`

source: Withdrawals
de: Auszahlungen
pt: Saques
ru: Выводы

# noWithdrawals
source: Nothing here yet. Create a withdrawal using the /withdrawal command.
de: Derzeit leer. Erstelle eine Auszahlung mit `/withdrawal`
pt: Está vazio por enquanto. Crie um saque com `/withdrawal`
ru: Тут пока пусто. Создайте вывод средств при помощи команды `/withdrawal`

source: In process
de: In Bearbeitung
pt: Em processamento
ru: В процессе

source: Paid
de: Bezahlt
pt: Pago
ru: Оплачен

source: Canceled
de: Abgebrochen
pt: Cancelado
ru: Отменён

# cardNumber
source: Account Number
de: Kontonummer
pt: Número da Conta
ru: Номер аккаунта

source: Amount
de: Betrag
pt: Valor
ru: Сумма

# statusField
source: Status
ru: Статус

# purchases
source: Recent Purchases
de: Letzte Käufe
pt: Compras Recentes
ru: Недавние покупки

# noPurchases
source: Nothing here yet. Users haven't made any purchases yet.
de: Derzeit leer. Noch keine Käufe.
pt: Está vazio por enquanto. Nenhuma compra ainda.
ru: Тут пока пусто. Пользователи пока не совершали покупки.

source: Buyer
de: Käufer: <@{0}>
pt: Comprador: <@{0}>
ru: Покупатель: <@{0}>

source: Role
de: Rolle
pt: Cargo
ru: Роль

source: Profit
de: Gewinn: **{0} ₽**
pt: Lucro: **{0} ₽**
ru: Прибыль: **{0} ₽**

source: Date
de: Datum
pt: Data
ru: Дата

source: Support
pt: Suporte
ru: Поддержка

# terms
source: Terms of Service
de: Nutzungsbedingungen
pt: Termos de Serviço
ru: Условия предоставления услуг

# withdrawalStatus_paid
source: Paid
de: Bezahlt
pt: Pago
ru: Выплачен

# withdrawalStatus_inprocess
source: In process
de: In Bearbeitung
pt: Em processamento
ru: В процессе

# withdrawalStatus_canceled
source: Canceled
de: Abgebrochen
pt: Cancelado
ru: Отменён

# withdrawalStatus
source: Status: **{0}**
ru: Статус: **{0}**

# withdrawalDateCard
source: {0:dd/MM/yyyy H:mm} Card
de: {0:dd/MM/yyyy H:mm} Karte
pt: {0:dd/MM/yyyy H:mm} Cartão
ru: {0:dd/MM/yyyy H:mm} Карта

# withdrawalAmount
source: Amount: **{0} ₽**
de: Betrag: **{0} ₽**
pt: Valor: **{0} ₽**
ru: Сумма: **{0} ₽**

# withdrawalAccountNumber
source: Account number: ||{0}||
de: Kontonummer: ||{0}||
pt: Número da conta: ||{0}||
ru: Номер счёта: ||{0}||

# productPrice
source: Price: **{0} ₽**
de: Preis: **{0} ₽**
pt: Preço: **{0} ₽**
ru: Стоимость: **{0} ₽**

# productRole
source: Role: <@&{0}>
de: Rolle: <@&{0}>
pt: Cargo: <@&{0}>
ru: Роль: <@&{0}>

# infoCommandDescription
source: Shop information
de: Shop-Informationen
pt: Informações da loja
ru: Информация о магазине

# dateUtc
source: Date: `{0} (UTC)`
de: Datum: `{0} (UTC)`
pt: Data: `{0} (UTC)`
ru: Дата: `{0} (UTC)`

source: Terms of Service
de: Nutzungsbedingungen
pt: Termos de Serviço
ru: Условия предоставления услуг

source: Language
de: Sprache
pt: Idioma
ru: Язык

# invalidEmoji
source: Use valid emoji
de: Bitte ein gültiges Emoji verwenden
pt: Use um emoji válido
ru: Используйте допустимый emoji

# productCreated
source: New product has been created.
de: Neues Produkt wurde erstellt.
pt: Novo produto foi criado.
ru: Новый товар создан.

# productEdited
source: Product has been updated.
de: Produkt wurde aktualisiert.
pt: Produto foi atualizado.
ru: Товар обновлён.

# productDeleted
source: Product has been deleted.
de: Produkt wurde gelöscht.
pt: Produto foi excluído.
ru: Товар удалён.

# botRoleTooLow
source: Bot's role ({0}) is lower than the product's role ({1}).\nFix this in role settings.
de: Die Bot-Rolle ({0}) ist niedriger als die Produkt-Rolle ({1}).\nBitte in den Rolleneinstellungen korrigieren.
pt: O cargo do bot ({0}) é inferior ao cargo do produto ({1}).\nCorrija isso nas configurações de cargos.
ru: Роль бота ({0}) ниже, чем роль товара ({1}).\nИсправьте это в настройках ролей.

# setup.selectProduct.placeholder
source: 🛍️ Select a product to buy
de: 🛍️ Produkt zum Kauf auswählen
pt: 🛍️ Selecione um produto para comprar
ru: 🛍️ Выберите товар для покупки

# setup.selectProduct.warning
source: :warning: After updating shop products, this message must be deleted and reset using the /setup command.
de: :warning: Nach Aktualisierung der Shop-Produkte muss diese Nachricht gelöscht und mit dem Befehl /setup neu erstellt werden.
pt: :warning: Após atualizar os produtos da loja, esta mensagem deve ser excluída e redefinida usando o comando /setup.
ru: :warning: После обновления товаров магазина это сообщение необходимо удалить и сбросить с помощью команды /setup.

# setup.invalidProduct
source: :no_entry_sign: The selected product is invalid.
de: :no_entry_sign: Das ausgewählte Produkt ist ungültig.
pt: :no_entry_sign: O produto selecionado é inválido.
ru: :no_entry_sign: Выбран недопустимый товар.

# setup.selectPayment.placeholder
source: 💳 Select a payment method
de: 💳 Zahlungsmethode auswählen
pt: 💳 Selecione um método de pagamento
ru: 💳 Выберите способ оплаты

# setup.invalidPaymentMethod
source: :no_entry_sign: The selected payment method is invalid.
de: :no_entry_sign: Die ausgewählte Zahlungsmethode ist ungültig.
pt: :no_entry_sign: O método de pagamento selecionado é inválido.
ru: :no_entry_sign: Выбран недопустимый способ оплаты.

# setup.paymentError
source: :no_entry_sign: Failed to create payment: {0}
de: :no_entry_sign: Zahlung konnte nicht erstellt werden: {0}
pt: :no_entry_sign: Falha ao criar pagamento: {0}
ru: :no_entry_sign: Не удалось создать платёж: {0}

# setup.paymentEmbed.title
source: 💸 Payment
de: 💸 Zahlung
pt: 💸 Pagamento
ru: 💸 Платёж

# setup.paymentEmbed.description
source: Pay the [invoice]({0}) within 10 minutes.
de: Bitte die [Rechnung]({0}) innerhalb von 10 Minuten bezahlen.
pt: Pague a [fatura]({0}) em até 10 minutos.
ru: Оплатите [счёт]({0}) в течение 10 минут.

# setup.paymentButton.label
source: Pay | {0} ₽
de: Bezahlen | {0} ₽
pt: Pagar | {0} ₽
ru: Оплатить | {0} ₽

# withdrawal.cardInvalid
source: :no_entry_sign: Invalid card number specified.
de: :no_entry_sign: Ungültige Kartennummer angegeben.
pt: :no_entry_sign: Número de cartão inválido especificado.
ru: :no_entry_sign: Указан неверный номер карты.

# withdrawal.created.title
source: 💸 Withdrawal Created
de: 💸 Auszahlung erstellt
pt: 💸 Saque Criado
ru: 💸 Заявка на вывод средств

# withdrawal.created.description
source: If the funds do not arrive at the specified account within 24 hours, please contact support.
de: Falls die Mittel innerhalb von 24 Stunden nicht auf dem angegebenen Konto eingehen, bitte den Support kontaktieren.
pt: Se os fundos não chegarem na conta especificada em 24 horas, por favor entre em contato com o suporte.
ru: Если средства не поступят на указанный счёт в течение 24 часов, пожалуйста, свяжитесь с поддержкой.

# withdrawal.created.amountField
source: 💵 Amount
de: 💵 Betrag
pt: 💵 Valor
ru: 💵 Сумма

# withdrawal.created.cardField
source: 💳 Card Number
de: 💳 Kartennummer
pt: 💳 Número do Cartão
ru: 💳 Номер карты

# withdrawal.created.warning
source: -# In case of an error during withdrawal, the funds will be returned to the shop balance.
de: -# Bei einem Fehler während der Auszahlung werden die Mittel dem Shop-Kontostand gutgeschrieben.
pt: -# Em caso de erro durante o saque, os fundos serão devolvidos ao saldo da loja.
ru: -# В случае ошибки при выводе средств средства будут возвращены на баланс магазина.

# settingsButton
source: Settings
de: Einstellungen
pt: Configurações
ru: Настройки

# settingsCurrent
source: Current store settings
de: Aktuelle Shop-Einstellungen
pt: Configurações atuais da loja
ru: Настройки текущего магазина

# settingsLanguageDescription
source: Change store language
de: Shop-Sprache ändern
pt: Alterar idioma da loja
ru: Изменение языка магазина

# settingsNewLanguageSelected
source: Language was successfully changed
de: Sprache wurde erfolgreich geändert
pt: Idioma alterado com sucesso
ru: Язык был изменен
